results/results_c5_large/results_c5_large_run2/oltp_read_write_t8/sysbench.log
sysbench 1.1.0-3ceba0b (using bundled LuaJIT 2.1.0-beta3)

Running the test with following options:
Number of threads: 8
Report intermediate results every 10 second(s)
Initializing random number generator from current time


Initializing worker threads...

Threads started!

[ 10s ] thds: 8 tps: 87.49 qps: 1758.30 (r/w/o: 1232.19/98.68/427.43) lat (ms,95%): 161.51 err/s: 0.00 reconn/s: 0.00
[ 20s ] thds: 8 tps: 85.90 qps: 1720.05 (r/w/o: 1204.13/99.40/416.51) lat (ms,95%): 161.51 err/s: 0.00 reconn/s: 0.00
[ 30s ] thds: 8 tps: 88.00 qps: 1756.80 (r/w/o: 1229.70/100.50/426.60) lat (ms,95%): 164.45 err/s: 0.00 reconn/s: 0.00
[ 40s ] thds: 8 tps: 84.60 qps: 1693.70 (r/w/o: 1185.80/97.20/410.70) lat (ms,95%): 167.44 err/s: 0.00 reconn/s: 0.00
[ 50s ] thds: 8 tps: 86.50 qps: 1729.70 (r/w/o: 1210.20/100.60/418.90) lat (ms,95%): 161.51 err/s: 0.00 reconn/s: 0.00
[ 60s ] thds: 8 tps: 85.30 qps: 1707.10 (r/w/o: 1195.60/98.60/412.90) lat (ms,95%): 167.44 err/s: 0.00 reconn/s: 0.00
[ 70s ] thds: 8 tps: 86.60 qps: 1727.50 (r/w/o: 1208.40/100.10/419.00) lat (ms,95%): 158.63 err/s: 0.00 reconn/s: 0.00
[ 80s ] thds: 8 tps: 78.70 qps: 1579.11 (r/w/o: 1106.00/89.30/383.80) lat (ms,95%): 186.54 err/s: 0.00 reconn/s: 0.00
[ 90s ] thds: 8 tps: 85.40 qps: 1705.60 (r/w/o: 1193.80/97.70/414.10) lat (ms,95%): 161.51 err/s: 0.00 reconn/s: 0.00
[ 100s ] thds: 8 tps: 83.70 qps: 1674.70 (r/w/o: 1172.50/95.50/406.70) lat (ms,95%): 173.58 err/s: 0.00 reconn/s: 0.00
[ 110s ] thds: 8 tps: 84.90 qps: 1697.30 (r/w/o: 1188.20/98.40/410.70) lat (ms,95%): 164.45 err/s: 0.00 reconn/s: 0.00
[ 120s ] thds: 8 tps: 82.70 qps: 1656.49 (r/w/o: 1159.59/97.20/399.70) lat (ms,95%): 170.48 err/s: 0.00 reconn/s: 0.00
SQL statistics:
    queries performed:
        read:                            142884
        write:                           11739
        other:                           49497
        total:                           204120
    transactions:                        10206  (85.02 per sec.)
    queries:                             204120 (1700.47 per sec.)
    ignored errors:                      0      (0.00 per sec.)
    reconnects:                          0      (0.00 per sec.)

Throughput:
    events/s (eps):                      85.0237
    time elapsed:                        120.0371s
    total number of events:              10206

Latency (ms):
         min:                                   32.84
         avg:                                   94.08
         max:                                  397.84
         95th percentile:                      167.44
         sum:                               960158.97

Threads fairness:
    events (avg/stddev):           1275.7500/9.09
    execution time (avg/stddev):   120.0199/0.01